In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [178]:
data=pd.read_excel("Data_Train.xlsx")

In [179]:
data.tail()
#data[pd.isnull(data["Power"])]
d=data

In [80]:
test=pd.read_excel("Data_test.xlsx")

In [81]:
test.tail()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price
1229,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN
1230,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN
1231,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN
1232,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN
1233,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN

In [4]:
#!pip install xlrd

In [5]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [113]:
#data[pd.isnull(data["Power"])]

In [114]:
data.drop(labels="Price",axis=1,inplace=True)

In [115]:
data=pd.concat([data,test])

In [116]:
data.shape

(7253, 12)

In [117]:
data.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
dtype: int64

In [118]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN

In [119]:
data.dtypes

Name                  object
Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type            object
Mileage               object
Engine                object
Power                 object
Seats                float64
New_Price             object
dtype: object

In [120]:
#x=data["Name"][1].split(" ")[0:2]

In [121]:
def gett(x):
    return(x[0]+x[1])

In [122]:
#gett(x)

In [123]:
data["Name"]=data["Name"].apply(lambda x :x.split(" "))
data["Name"]=data["Name"].apply(lambda x : gett(x))

In [124]:
data["how_old"]=data["Year"].apply(lambda x: 2019-x)

In [125]:
data.drop(labels="New_Price",axis=1,inplace=True)

In [126]:
data[pd.isnull(data["Mileage"])]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,how_old
4446,MahindraE,Chennai,2016,50000,Electric,Automatic,First,NaN,72 CC,41 bhp,5.0,3
4904,ToyotaPrius,Mumbai,2011,44000,Electric,Automatic,First,NaN,1798 CC,73 bhp,5.0,8

In [127]:
data["Seats"].value_counts()

5.0     6047
7.0      796
8.0      170
4.0      119
6.0       38
2.0       18
10.0       8
9.0        3
0.0        1
Name: Seats, dtype: int64

In [128]:
#data[pd.isnull(data["Seats"])]

In [129]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,how_old
0,MarutiWagon,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,9
1,HyundaiCreta,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,4
2,HondaJazz,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8
3,MarutiErtiga,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,7
4,AudiA4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,6

In [130]:
setnull=data[["Fuel_Type","Power","Transmission","Mileage","Engine","Seats"]]

In [131]:
setnull.head()

  Fuel_Type      Power Transmission     Mileage   Engine  Seats
0       CNG  58.16 bhp       Manual  26.6 km/kg   998 CC    5.0
1    Diesel  126.2 bhp       Manual  19.67 kmpl  1582 CC    5.0
2    Petrol   88.7 bhp       Manual   18.2 kmpl  1199 CC    5.0
3    Diesel  88.76 bhp       Manual  20.77 kmpl  1248 CC    7.0
4    Diesel  140.8 bhp    Automatic   15.2 kmpl  1968 CC    5.0

In [132]:
a="26.65h"
a[0:4]

'26.6'

In [133]:
setnull["Mileage"]=setnull["Mileage"].astype("str")

In [134]:
setnull["Mileage"]=setnull["Mileage"].apply(lambda x : x[0:4])

In [135]:
setnull["Engine"]=setnull["Engine"].astype("str")

In [136]:
setnull["Engine"]=setnull["Engine"].apply(lambda x : x.replace("CC",""))

In [137]:
setnull["Power"]=setnull["Power"].astype("str")

In [138]:
setnull["Power"]=setnull["Power"].apply(lambda x : x.replace("bhp",""))

In [139]:
setnull[75:79]

   Fuel_Type    Power Transmission Mileage Engine  Seats
75    Diesel  187.74     Automatic    18.5  1968     5.0
76    Diesel    null        Manual    17.8  1399     5.0
77    Petrol     132        Manual    12.4  1998     8.0
78    Diesel     102        Manual    12.8  2494     7.0

In [140]:
setnull["Power"]=setnull["Power"].replace("null ",np.NaN)

In [141]:
from sklearn.preprocessing import LabelEncoder

In [142]:
le1=LabelEncoder()
le2=LabelEncoder()

In [143]:
setnull["Fuel_Type"]=le1.fit_transform(setnull["Fuel_Type"])
setnull["Transmission"]=le2.fit_transform(setnull["Transmission"])

In [144]:
#!pip install fancyimpute
setnull["Mileage"]=setnull["Mileage"].astype("float")
setnull["Engine"]=setnull["Engine"].astype("float")
setnull["Power"]=setnull["Power"].astype("float")

In [145]:
from fancyimpute import KNN
X_filles= KNN(k=7).fit_transform(setnull)

Imputing row 1/7253 with 0 missing, elapsed time: 8.382
Imputing row 101/7253 with 0 missing, elapsed time: 8.383
Imputing row 201/7253 with 0 missing, elapsed time: 8.384
Imputing row 301/7253 with 0 missing, elapsed time: 8.385
Imputing row 401/7253 with 0 missing, elapsed time: 8.386
Imputing row 501/7253 with 0 missing, elapsed time: 8.387
Imputing row 601/7253 with 0 missing, elapsed time: 8.387
Imputing row 701/7253 with 0 missing, elapsed time: 8.388
Imputing row 801/7253 with 0 missing, elapsed time: 8.389
Imputing row 901/7253 with 0 missing, elapsed time: 8.390
Imputing row 1001/7253 with 0 missing, elapsed time: 8.390
Imputing row 1101/7253 with 0 missing, elapsed time: 8.391
Imputing row 1201/7253 with 0 missing, elapsed time: 8.392
Imputing row 1301/7253 with 0 missing, elapsed time: 8.393
Imputing row 1401/7253 with 0 missing, elapsed time: 8.393
Imputing row 1501/7253 with 0 missing, elapsed time: 8.394
Imputing row 1601/7253 with 0 missing, elapsed time: 8.395
Imputing row 1701/7253 with 0 missing, elapsed time: 8.396
Imputing row 1801/7253 with 0 missing, elapsed time: 8.396
Imputing row 1901/7253 with 0 missing, elapsed time: 8.397
Imputing row 2001/7253 with 0 missing, elapsed time: 8.397
Imputing row 2101/7253 with 0 missing, elapsed time: 8.398
Imputing row 2201/7253 with 0 missing, elapsed time: 8.399
Imputing row 2301/7253 with 0 missing, elapsed time: 8.400
Imputing row 2401/7253 with 0 missing, elapsed time: 8.401
Imputing row 2501/7253 with 0 missing, elapsed time: 8.402
Imputing row 2601/7253 with 0 missing, elapsed time: 8.403
Imputing row 2701/7253 with 0 missing, elapsed time: 8.404
Imputing row 2801/7253 with 0 missing, elapsed time: 8.405
Imputing row 2901/7253 with 0 missing, elapsed time: 8.405
Imputing row 3001/7253 with 0 missing, elapsed time: 8.406
Imputing row 3101/7253 with 0 missing, elapsed time: 8.407
Imputing row 3201/7253 with 0 missing, elapsed time: 8.407
Imputing row 3301/7253 with 0 missing, elapsed time: 8.408
Imputing row 3401/7253 with 0 missing, elapsed time: 8.409
Imputing row 3501/7253 with 0 missing, elapsed time: 8.409
Imputing row 3601/7253 with 0 missing, elapsed time: 8.410
Imputing row 3701/7253 with 0 missing, elapsed time: 8.411
Imputing row 3801/7253 with 2 missing, elapsed time: 8.412
Imputing row 3901/7253 with 0 missing, elapsed time: 8.413
Imputing row 4001/7253 with 0 missing, elapsed time: 8.413
Imputing row 4101/7253 with 0 missing, elapsed time: 8.414
Imputing row 4201/7253 with 0 missing, elapsed time: 8.415
Imputing row 4301/7253 with 0 missing, elapsed time: 8.416
Imputing row 4401/7253 with 0 missing, elapsed time: 8.416
Imputing row 4501/7253 with 0 missing, elapsed time: 8.417
Imputing row 4601/7253 with 0 missing, elapsed time: 8.417
Imputing row 4701/7253 with 0 missing, elapsed time: 8.418
Imputing row 4801/7253 with 0 missing, elapsed time: 8.419
Imputing row 4901/7253 with 1 missing, elapsed time: 8.419
Imputing row 5001/7253 with 0 missing, elapsed time: 8.420
Imputing row 5101/7253 with 0 missing, elapsed time: 8.421
Imputing row 5201/7253 with 0 missing, elapsed time: 8.421
Imputing row 5301/7253 with 0 missing, elapsed time: 8.423
Imputing row 5401/7253 with 0 missing, elapsed time: 8.423
Imputing row 5501/7253 with 0 missing, elapsed time: 8.423
Imputing row 5601/7253 with 0 missing, elapsed time: 8.424
Imputing row 5701/7253 with 0 missing, elapsed time: 8.425
Imputing row 5801/7253 with 0 missing, elapsed time: 8.425
Imputing row 5901/7253 with 0 missing, elapsed time: 8.426
Imputing row 6001/7253 with 0 missing, elapsed time: 8.427
Imputing row 6101/7253 with 0 missing, elapsed time: 8.427
Imputing row 6201/7253 with 0 missing, elapsed time: 8.428
Imputing row 6301/7253 with 0 missing, elapsed time: 8.429
Imputing row 6401/7253 with 0 missing, elapsed time: 8.429
Imputing row 6501/7253 with 0 missing, elapsed time: 8.430
Imputing row 6601/7253 with 0 missing, elapsed time: 8.431
Imputing row 6701/7253 with 0 missing, elapsed time: 8.432
Imputing row 6801/7253 with 0 missing, elapsed time: 8.433
Imputing row 6901/7253 with 0 missing, elapsed time: 8.434
Imputing row 7001/7253 with 0 missing, elapsed time: 8.434
Imputing row 7101/7253 with 0 missing, elapsed time: 8.435
Imputing row 7201/7253 with 0 missing, elapsed time: 8.436

In [146]:
sett=pd.DataFrame(X_filles)

In [147]:
sett.columns=setnull.columns

In [148]:
sett.isnull().sum()

Fuel_Type       0
Power           0
Transmission    0
Mileage         0
Engine          0
Seats           0
dtype: int64

In [149]:
data.shape

(7253, 12)

In [150]:
data.shape

(7253, 12)

In [151]:
sett.shape

(7253, 6)

In [152]:
df=data.drop(["Fuel_Type","Power","Transmission","Mileage","Engine","Seats"],1)

In [153]:
sett.head()

   Fuel_Type   Power  Transmission  Mileage  Engine  Seats
0        0.0   58.16           1.0     26.6   998.0    5.0
1        1.0  126.20           1.0     19.6  1582.0    5.0
2        4.0   88.70           1.0     18.2  1199.0    5.0
3        1.0   88.76           1.0     20.7  1248.0    7.0
4        1.0  140.80           0.0     15.2  1968.0    5.0

In [154]:
sett.tail()

      Fuel_Type  Power  Transmission  Mileage  Engine  Seats
7248        1.0  103.6           1.0     20.5  1598.0    5.0
7249        4.0  103.6           0.0     17.2  1197.0    5.0
7250        1.0   63.1           1.0     23.0  1461.0    5.0
7251        4.0  103.6           0.0     17.2  1197.0    5.0
7252        1.0  170.0           0.0     10.0  2148.0    5.0

In [155]:
df=df.reset_index().drop(labels="index",axis=1)

In [156]:
df1=pd.concat([df,sett],axis=1)

In [157]:
df1.head()

,Name,Location,Year,Kilometers_Driven,Owner_Type,how_old,Fuel_Type,Power,Transmission,Mileage,Engine,Seats
0,MarutiWagon,Mumbai,2010,72000,First,9,0.0,58.16,1.0,26.6,998.0,5.0
1,HyundaiCreta,Pune,2015,41000,First,4,1.0,126.20,1.0,19.6,1582.0,5.0
2,HondaJazz,Chennai,2011,46000,First,8,4.0,88.70,1.0,18.2,1199.0,5.0
3,MarutiErtiga,Chennai,2012,87000,First,7,1.0,88.76,1.0,20.7,1248.0,7.0
4,AudiA4,Coimbatore,2013,40670,Second,6,1.0,140.80,0.0,15.2,1968.0,5.0

In [158]:
df1["Fuel_Type"]=df1["Fuel_Type"].astype("int")

In [159]:
df1["Fuel_Type"]=le1.inverse_transform(df1["Fuel_Type"])

In [160]:
df1["Transmission"]=df1["Transmission"].astype("int")

In [161]:
df1["Transmission"]=le2.inverse_transform(df1["Transmission"])

In [162]:
df1.isnull().sum()

Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Owner_Type           0
how_old              0
Fuel_Type            0
Power                0
Transmission         0
Mileage              0
Engine               0
Seats                0
dtype: int64

In [163]:
df1.head()

,Name,Location,Year,Kilometers_Driven,Owner_Type,how_old,Fuel_Type,Power,Transmission,Mileage,Engine,Seats
0,MarutiWagon,Mumbai,2010,72000,First,9,CNG,58.16,Manual,26.6,998.0,5.0
1,HyundaiCreta,Pune,2015,41000,First,4,Diesel,126.20,Manual,19.6,1582.0,5.0
2,HondaJazz,Chennai,2011,46000,First,8,Petrol,88.70,Manual,18.2,1199.0,5.0
3,MarutiErtiga,Chennai,2012,87000,First,7,Diesel,88.76,Manual,20.7,1248.0,7.0
4,AudiA4,Coimbatore,2013,40670,Second,6,Diesel,140.80,Automatic,15.2,1968.0,5.0

In [164]:
df1["Name"].value_counts().head()

MarutiSwift     418
HondaCity       318
Hyundaii20      303
ToyotaInnova    203
HyundaiVerna    200
Name: Name, dtype: int64

In [165]:
Namee=pd.get_dummies(df1["Name"],prefix="Name")
owner_type=pd.get_dummies(df1["Owner_Type"],prefix="Owner")
how_old=pd.get_dummies(df1["how_old"],prefix="old")
fuel_type=pd.get_dummies(df1["Fuel_Type"],prefix="fuel")
transm=pd.get_dummies(df1["Transmission"],prefix="Trans")

In [166]:
Namee.shape , df1.shape

((7253, 223), (7253, 12))

In [167]:
df1=pd.concat([Namee,owner_type,how_old,fuel_type,transm,df1],axis=1)

In [168]:
df1.drop(["Name","Owner_Type","how_old","Fuel_Type","Transmission"],axis=1,inplace=True)

In [169]:
df1.drop(["Location","Year"],axis=1,inplace=True)

In [98]:
df1.head()

,Name_AmbassadorClassic,Name_AudiA3,Name_AudiA4,Name_AudiA6,Name_AudiA7,Name_AudiA8,Name_AudiQ3,Name_AudiQ5,Name_AudiQ7,Name_AudiRS5,...,fuel_2,fuel_3,fuel_4,Trans_0,Trans_1,Kilometers_Driven,Power,Mileage,Engine,Seats
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,72000,58.16,26.6,998.0,5.0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,41000,126.20,19.6,1582.0,5.0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,1,46000,88.70,18.2,1199.0,5.0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,87000,88.76,20.7,1248.0,7.0
4,0,0,1,0,0,0,0,0,0,0,...,0,0,0,1,0,40670,140.80,15.2,1968.0,5.0

In [170]:
d.shape

(6019, 12)

In [171]:
df2=df1.iloc[0:6019,:]

In [172]:
testy=df1.iloc[6019:,:]

In [173]:
df2.shape

(6019, 262)

In [174]:
from scipy.stats import zscore

In [175]:
X=df2.apply(zscore)

In [180]:
y=d["Price"]

In [187]:
X.head()

,Name_AmbassadorClassic,Name_AudiA3,Name_AudiA4,Name_AudiA6,Name_AudiA7,Name_AudiA8,Name_AudiQ3,Name_AudiQ5,Name_AudiQ7,Name_AudiRS5,...,fuel_Electric,fuel_LPG,fuel_Petrol,Trans_Automatic,Trans_Manual,Kilometers_Driven,Power,Mileage,Engine,Seats
0,-0.012891,-0.025788,-0.114582,-0.090596,-0.022331,-0.018232,-0.067127,-0.070776,-0.079709,-0.018232,...,-0.018232,-0.040794,-0.915962,-0.632529,0.632529,0.145315,-1.012536,1.853266,-1.035548,-0.343592
1,-0.012891,-0.025788,-0.114582,-0.090596,-0.022331,-0.018232,-0.067127,-0.070776,-0.079709,-0.018232,...,-0.018232,-0.040794,-0.915962,-0.632529,0.632529,-0.194369,0.252373,0.324897,-0.062996,-0.343592
2,-0.012891,-0.025788,-0.114582,-0.090596,-0.022331,-0.018232,-0.067127,-0.070776,-0.079709,-0.018232,...,-0.018232,-0.040794,1.091749,-0.632529,0.632529,-0.139581,-0.444777,0.019223,-0.700817,-0.343592
3,-0.012891,-0.025788,-0.114582,-0.090596,-0.022331,-0.018232,-0.067127,-0.070776,-0.079709,-0.018232,...,-0.018232,-0.040794,-0.915962,-0.632529,0.632529,0.309678,-0.443661,0.565069,-0.619216,2.133789
4,-0.012891,-0.025788,8.727352,-0.090596,-0.022331,-0.018232,-0.067127,-0.070776,-0.079709,-0.018232,...,-0.018232,-0.040794,-0.915962,1.580955,-1.580955,-0.197985,0.523797,-0.635792,0.579821,-0.343592

In [181]:
from sklearn.model_selection import train_test_split

In [189]:
X_train,X_test,y_train,y_test=train_test_split(df2,y,test_size=0.3,random_state=1)

In [190]:
from sklearn.datasets import load_boston
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Ridge

In [191]:
lr = LinearRegression()
lr.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [192]:
lr.score(X_test,y_test)

0.7805904367767766

In [199]:
rr = Ridge(alpha=0.01) # higher the alpha value, more restriction on the coefficients; low alpha > more generalization, coefficients are barely
# restricted and in this case linear and ridge regression resembles
rr.fit(X_train, y_train)

Ridge(alpha=0.01, copy_X=True, fit_intercept=True, max_iter=None,
      normalize=False, random_state=None, solver='auto', tol=0.001)

In [200]:
rr.score(X_test,y_test)

0.7808334361425114

In [201]:
pre=rr.predict(X_test)

In [202]:
from sklearn.metrics import mean_squared_error
mean_squared_error(pre,y_test)

26.02697054854508

In [203]:
np.sqrt(np.mean((y_test-pre)**2))

5.1016635079692465

In [204]:
np.mean(np.abs((pre - y_test) / y_test)) * 100

40.4452297642327

In [205]:
y_pre=rr.predict(testy)

In [206]:
g=pd.read_excel("Sample_submission.xlsx")

In [207]:
g.head()

   Price
0  55.02
1  56.46
2  34.61
3  16.89
4  50.48

In [208]:
g["Price"]=y_pre

In [209]:
g.head()

       Price
0   2.263254
1   0.837894
2  19.998090
3   1.481099
4   4.580764

In [210]:
g.to_csv("submissin.csv")